---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsRun.GetAllSupports
source: html/a860f418-9de2-3600-5105-a48be8544a41.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.GetAllSupports Method

Retrieves all supports hosted by the stair's run.

## Syntax (C#)
```csharp
public IList<ElementId> GetAllSupports()
```

## Returns
All supports hosted by the stair's run.

## Remarks
The supports consist of left, right, and middle supports of the stair's run.